{
    "mixins": {
        "mixin": {
            "DocumentOrShadowRoot": {
                "methods": {
                    "method": {
                        "elementFromPoint": {
                            "comment": "Returns the element for the specified x coordinate and the specified y coordinate.\n@param x The x-offset\n@param y The y-offset"
                        }
                    }
                },
                "properties": {
                    "property": {
                        "styleSheets": {
                            "comment": "Retrieves a collection of styleSheet objects representing the style sheets that correspond to each instance of a link or style object in the document."
                        }
                    }
                }
            },
            "GlobalEventHandlers": {
                "properties": {
                    "property": {
                        "ondragleave": {
                            "comment": "Fires on the target object when the user moves the mouse out of a valid drop target during a drag operation.\n@param ev The drag event."
                        },
                        "ondragenter": {
                            "comment": "Fires on the target element when the user drags the object to a valid drop target.\n@param ev The drag event."
                        },
                        "ondragend": {
                            "comment": "Fires on the source object when the user releases the mouse at the close of a drag operation.\n@param ev The event."
                        },
                        "ondragover": {
                            "comment": "Fires on the target element continuously while the user drags the object over a valid drop target.\n@param ev The event."
                        },
                        "ondragstart": {
                            "comment": "Fires on the source object when the user starts to drag a text selection or selected object.\n@param ev The event."
                        },
                        "ondrag": {
                            "comment": "Fires on the source object continuously during a drag operation.\n@param ev The event."
                        },
                        "onseeked": {
                            "comment": "Occurs when the seek operation ends.\n@param ev The event."
                        },
                        "onseeking": {
                            "comment": "Occurs when the current playback position is moved.\n@param ev The event."
                        },
                        "onreset": {
                            "comment": "Fires when the user resets a form.\n@param ev The event."
                        },
                        "onkeydown": {
                            "comment": "Fires when the user presses a key.\n@param ev The keyboard event"
                        },
                        "onkeyup": {
                            "comment": "Fires when the user releases a key.\n@param ev The keyboard event"
                        },
                        "ondurationchange": {
                            "comment": "Occurs when the duration attribute is updated.\n@param ev The event."
                        },
                        "onblur": {
                            "comment": "Fires when the object loses the input focus.\n@param ev The focus event."
                        },
                        "onload": {
                            "comment": "Fires immediately after the browser loads the object.\n@param ev The event."
                        },
                        "onscroll": {
                            "comment": "Fires when the user repositions the scroll box in the scroll bar on the object.\n@param ev The event."
                        },
                        "onpause": {
                            "comment": "Occurs when playback is paused.\n@param ev The event."
                        },
                        "onmousedown": {
                            "comment": "Fires when the user clicks the object with either mouse button.\n@param ev The mouse event."
                        },
                        "onclick": {
                            "comment": "Fires when the user clicks the left mouse button on the object\n@param ev The mouse event."
                        },
                        "onwaiting": {
                            "comment": "Occurs when playback stops because the next frame of a video resource is not available.\n@param ev The event."
                        },
                        "onkeypress": {
                            "comment": "Fires when the user presses an alphanumeric key.\n@param ev The event."
                        },
                        "onloadeddata": {
                            "comment": "Occurs when media data is loaded at the current playback position.\n@param ev The event."
                        },
                        "onfocus": {
                            "comment": "Fires when the object receives focus.\n@param ev The event."
                        },
                        "ontimeupdate": {
                            "comment": "Occurs to indicate the current playback position.\n@param ev The event."
                        },
                        "onselect": {
                            "comment": "Fires when the current selection changes.\n@param ev The event."
                        },
                        "onended": {
                            "comment": "Occurs when the end of playback is reached.\n@param ev The event"
                        },
                        "onabort": {
                            "comment": "Fires when the user aborts the download.\n@param ev The event."
                        },
                        "onratechange": {
                            "comment": "Occurs when the playback rate is increased or decreased.\n@param ev The event."
                        },
                        "onprogress": {
                            "comment": "Occurs to indicate progress while downloading media data.\n@param ev The event."
                        },
                        "ondblclick": {
                            "comment": "Fires when the user double-clicks the object.\n@param ev The mouse event."
                        },
                        "oncontextmenu": {
                            "comment": "Fires when the user clicks the right mouse button in the client area, opening the context menu.\n@param ev The mouse event."
                        },
                        "onloadedmetadata": {
                            "comment": "Occurs when the duration and dimensions of the media have been determined.\n@param ev The event."
                        },
                        "onerror": {
                            "comment": "Fires when an error occurs during object loading.\n@param ev The event."
                        },
                        "onplay": {
                            "comment": "Occurs when the play method is requested.\n@param ev The event."
                        },
                        "onplaying": {
                            "comment": "Occurs when the audio or video has started playing.\n@param ev The event."
                        },
                        "onstalled": {
                            "comment": "Occurs when the download has stopped.\n@param ev The event."
                        },
                        "onmousemove": {
                            "comment": "Fires when the user moves the mouse over the object.\n@param ev The mouse event."
                        },
                        "onmouseup": {
                            "comment": "Fires when the user releases a mouse button while the mouse is over the object.\n@param ev The mouse event."
                        },
                        "onmouseover": {
                            "comment": "Fires when the user moves the mouse pointer into the object.\n@param ev The mouse event."
                        },
                        "onsuspend": {
                            "comment": "Occurs if the load operation has been intentionally halted.\n@param ev The event."
                        },
                        "onmouseout": {
                            "comment": "Fires when the user moves the mouse pointer outside the boundaries of the object.\n@param ev The mouse event."
                        },
                        "onvolumechange": {
                            "comment": "Occurs when the volume is changed, or playback is muted or unmuted.\n@param ev The event."
                        },
                        "onchange": {
                            "comment": "Fires when the contents of the object or selection have changed.\n@param ev The event."
                        },
                        "oncanplay": {
                            "comment": "Occurs when playback is possible, but would require further buffering.\n@param ev The event."
                        },
                        "onloadstart": {
                            "comment": "Occurs when Internet Explorer begins looking for media data.\n@param ev The event."
                        },
                        "onemptied": {
                            "comment": "Occurs when the media element is reset to its initial state.\n@param ev The event."
                        }
                    }
                }
            }
        }
    },
    "interfaces": {
        "interface": {
            "Headers": {
                "iterator": {
                    "comments": {
                        "comment": {
                            "entries": "Returns an iterator allowing to go through all key/value pairs contained in this object.",
                            "keys": "Returns an iterator allowing to go through all keys of the key/value pairs contained in this object.",
                            "values": "Returns an iterator allowing to go through all values of the key/value pairs contained in this object."
                        }
                    }
                }
            },
            "FormData": {
                "iterator": {
                    "comments": {
                        "comment": {
                            "entries": "Returns an array of key, value pairs for every entry in the list.",
                            "keys": "Returns a list of keys in the list.",
                            "values": "Returns a list of values in the list."
                        }
                    }
                }
            },
            "NodeListOf": {
                "methods": {
                    "method": {
                        "forEach": {
                            "comment": "Performs the specified action for each node in an list.\n@param callbackfn  A function that accepts up to three arguments. forEach calls the callbackfn function one time for each element in the list.\n@param thisArg  An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                        }
                    }
                },
                "iterator": {
                    "comments": {
                        "comment": {
                            "entries": "Returns an array of key, value pairs for every entry in the list.",
                            "keys": "Returns an list of keys in the list.",
                            "values": "Returns an list of values in the list."
                        }
                    }
                }
            },
            "NodeList": {
                "methods": {
                    "method": {
                        "forEach": {
                            "comment": "Performs the specified action for each node in an list.\n@param callbackfn  A function that accepts up to three arguments. forEach calls the callbackfn function one time for each element in the list.\n@param thisArg  An object to which the this keyword can refer in the callbackfn function. If thisArg is omitted, undefined is used as the this value."
                        }
                    }
                },
                "iterator": {
                    "comments": {
                        "comment": {
                            "entries": "Returns an array of key, value pairs for every entry in the list.",
                            "keys": "Returns an list of keys in the list.",
                            "values": "Returns an list of values in the list."
                        }
                    }
                }
            },
            "HTMLTableElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "cellSpacing": {
                            "comment": "Sets or retrieves the amount of space between cells in a table."
                        },
                        "tFoot": {
                            "comment": "Retrieves the tFoot object of the table."
                        },
                        "frame": {
                            "comment": "Sets or retrieves the way the border frame around the table is displayed."
                        },
                        "rows": {
                            "comment": "Sets or retrieves the number of horizontal rows contained in the object."
                        },
                        "rules": {
                            "comment": "Sets or retrieves which dividing lines (inner borders) are displayed."
                        },
                        "summary": {
                            "comment": "Sets or retrieves a description and/or structure of the object."
                        },
                        "caption": {
                            "comment": "Retrieves the caption object of a table."
                        },
                        "tBodies": {
                            "comment": "Retrieves a collection of all tBody objects in the table. Objects in this collection are in source order."
                        },
                        "tHead": {
                            "comment": "Retrieves the tHead object of the table."
                        },
                        "align": {
                            "comment": "Sets or retrieves a value that indicates the table alignment."
                        },
                        "cellPadding": {
                            "comment": "Sets or retrieves the amount of space between the border of the cell and the content of the cell."
                        },
                        "border": {
                            "comment": "Sets or retrieves the width of the border to draw around the object."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "deleteRow": {
                            "comment": "Removes the specified row (tr) from the element and from the rows collection.\n@param index Number that specifies the zero-based position in the rows collection of the row to remove."
                        },
                        "createTBody": {
                            "comment": "Creates an empty tBody element in the table."
                        },
                        "deleteCaption": {
                            "comment": "Deletes the caption element and its contents from the table."
                        },
                        "insertRow": {
                            "comment": "Creates a new row (tr) in the table, and adds the row to the rows collection.\n@param index Number that specifies where to insert the row in the rows collection. The default value is -1, which appends the new row to the end of the rows collection."
                        },
                        "deleteTFoot": {
                            "comment": "Deletes the tFoot element and its contents from the table."
                        },
                        "createTHead": {
                            "comment": "Returns the tHead element object if successful, or null otherwise."
                        },
                        "deleteTHead": {
                            "comment": "Deletes the tHead element and its contents from the table."
                        },
                        "createCaption": {
                            "comment": "Creates an empty caption element in the table."
                        },
                        "createTFoot": {
                            "comment": "Creates an empty tFoot element in the table."
                        }
                    }
                }
            },
            "HTMLBaseElement": {
                "properties": {
                    "property": {
                        "target": {
                            "comment": "Sets or retrieves the window or frame at which to target content."
                        },
                        "href": {
                            "comment": "Gets or sets the baseline URL on which relative links are based."
                        }
                    }
                }
            },
            "HTMLParagraphElement": {
                "properties": {
                    "property": {
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        }
                    }
                }
            },
            "HTMLOListElement": {
                "properties": {
                    "property": {
                        "start": {
                            "comment": "The starting number."
                        }
                    }
                }
            },
            "HTMLSelectElement": {
                "properties": {
                    "property": {
                        "value": {
                            "comment": "Sets or retrieves the value which is returned to the server when the form control is submitted."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "size": {
                            "comment": "Sets or retrieves the number of rows in the list box."
                        },
                        "length": {
                            "comment": "Sets or retrieves the number of objects in a collection."
                        },
                        "selectedIndex": {
                            "comment": "Sets or retrieves the index of the selected option in a select object."
                        },
                        "multiple": {
                            "comment": "Sets or retrieves the Boolean value indicating whether multiple items can be selected from a list."
                        },
                        "type": {
                            "comment": "Retrieves the type of select control based on the value of the MULTIPLE attribute."
                        },
                        "validationMessage": {
                            "comment": "Returns the error message that would be displayed if the user submits the form, or an empty string if no error message. It also triggers the standard error message, such as \"this is a required field\". The result is that the user sees validation messages without actually submitting."
                        },
                        "validity": {
                            "comment": "Returns a  ValidityState object that represents the validity states of an element."
                        },
                        "required": {
                            "comment": "When present, marks an element that can't be submitted without a value."
                        },
                        "willValidate": {
                            "comment": "Returns whether an element will successfully validate based on forms validation rules and constraints."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "remove": {
                            "comment": "Removes an element from the collection.\n@param index Number that specifies the zero-based index of the element to remove from the collection."
                        },
                        "add": {
                            "comment": "Adds an element to the areas, controlRange, or options collection.\n@param element Variant of type Number that specifies the index position in the collection where the element is placed. If no value is given, the method places the element at the end of the collection.\n@param before Variant of type Object that specifies an element to insert before, or null to append the object to the collection."
                        },
                        "item": {
                            "comment": "Retrieves a select object or an object from an options collection.\n@param name Variant of type Number or String that specifies the object or collection to retrieve. If this parameter is an integer, it is the zero-based index of the object. If this parameter is a string, all objects with matching name or id properties are retrieved, and a collection is returned if more than one match is made.\n@param index Variant of type Number that specifies the zero-based index of the object to retrieve when a collection is returned."
                        },
                        "namedItem": {
                            "comment": "Retrieves a select object or an object from an options collection.\n@param namedItem A String that specifies the name or id property of the object to retrieve. A collection is returned if more than one match is made."
                        },
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        },
                        "setCustomValidity": {
                            "comment": "Sets a custom error message that is displayed when a form is submitted.\n@param error Sets a custom error message that is displayed when a form is submitted."
                        }
                    }
                }
            },
            "HTMLMetaElement": {
                "properties": {
                    "property": {
                        "httpEquiv": {
                            "comment": "Gets or sets information used to bind the value of a content attribute of a meta element to an HTTP response header."
                        },
                        "name": {
                            "comment": "Sets or retrieves the value specified in the content attribute of the meta object."
                        },
                        "content": {
                            "comment": "Gets or sets meta-information to associate with httpEquiv or name."
                        },
                        "scheme": {
                            "comment": "Sets or retrieves a scheme to be used in interpreting the value of a property specified for the object."
                        }
                    }
                }
            },
            "HTMLLinkElement": {
                "properties": {
                    "property": {
                        "rel": {
                            "comment": "Sets or retrieves the relationship between the object and the destination of the link."
                        },
                        "target": {
                            "comment": "Sets or retrieves the window or frame at which to target content."
                        },
                        "href": {
                            "comment": "Sets or retrieves a destination URL or an anchor point."
                        },
                        "media": {
                            "comment": "Sets or retrieves the media type."
                        },
                        "rev": {
                            "comment": "Sets or retrieves the relationship between the object and the destination of the link."
                        },
                        "type": {
                            "comment": "Sets or retrieves the MIME type of the object."
                        },
                        "charset": {
                            "comment": "Sets or retrieves the character set used to encode the object."
                        },
                        "hreflang": {
                            "comment": "Sets or retrieves the language code of the object."
                        }
                    }
                }
            },
            "HTMLFontElement": {
                "properties": {
                    "property": {
                        "face": {
                            "comment": "Sets or retrieves the current typeface family."
                        }
                    }
                }
            },
            "HTMLTableCaptionElement": {
                "properties": {
                    "property": {
                        "align": {
                            "comment": "Sets or retrieves the alignment of the caption or legend."
                        }
                    }
                }
            },
            "HTMLOptionElement": {
                "properties": {
                    "property": {
                        "index": {
                            "comment": "Sets or retrieves the ordinal position of an option in a list box."
                        },
                        "defaultSelected": {
                            "comment": "Sets or retrieves the status of an option."
                        },
                        "value": {
                            "comment": "Sets or retrieves the value which is returned to the server when the form control is submitted."
                        },
                        "text": {
                            "comment": "Sets or retrieves the text string specified by the option tag."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "label": {
                            "comment": "Sets or retrieves a value that you can use to implement your own label functionality for the object."
                        },
                        "selected": {
                            "comment": "Sets or retrieves whether the option in the list box is the default item."
                        }
                    }
                }
            },
            "HTMLMapElement": {
                "properties": {
                    "property": {
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "areas": {
                            "comment": "Retrieves a collection of the area objects defined for the given map object."
                        }
                    }
                }
            },
            "HTMLCollection": {
                "properties": {
                    "property": {
                        "length": {
                            "comment": "Sets or retrieves the number of objects in a collection."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "item": {
                            "comment": "Retrieves an object from various collections."
                        },
                        "namedItem": {
                            "comment": "Retrieves a select object or an object from an options collection."
                        }
                    }
                }
            },
            "HTMLImageElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "vspace": {
                            "comment": "Sets or retrieves the vertical margin for the object."
                        },
                        "naturalHeight": {
                            "comment": "The original height of the image resource before sizing."
                        },
                        "alt": {
                            "comment": "Sets or retrieves a text alternative to the graphic."
                        },
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        },
                        "src": {
                            "comment": "The address or URL of the a media resource that is to be considered."
                        },
                        "useMap": {
                            "comment": "Sets or retrieves the URL, often with a bookmark extension (#name), to use as a client-side image map."
                        },
                        "naturalWidth": {
                            "comment": "The original width of the image resource before sizing."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "height": {
                            "comment": "Sets or retrieves the height of the object."
                        },
                        "border": {
                            "comment": "Specifies the properties of a border drawn around an object."
                        },
                        "hspace": {
                            "comment": "Sets or retrieves the width of the border to draw around the object."
                        },
                        "loading": {
                            "comment": "Sets or retrieves the policy for loading image elements that are outside the viewport."
                        },
                        "longDesc": {
                            "comment": "Sets or retrieves a Uniform Resource Identifier (URI) to a long description of the object."
                        },
                        "isMap": {
                            "comment": "Sets or retrieves whether the image is a server-side image map."
                        },
                        "complete": {
                            "comment": "Retrieves whether the object is fully loaded."
                        }
                    }
                }
            },
            "HTMLAreaElement": {
                "properties": {
                    "property": {
                        "alt": {
                            "comment": "Sets or retrieves a text alternative to the graphic."
                        },
                        "coords": {
                            "comment": "Sets or retrieves the coordinates of the object."
                        },
                        "target": {
                            "comment": "Sets or retrieves the window or frame at which to target content."
                        },
                        "noHref": {
                            "comment": "Sets or gets whether clicks in this region cause action."
                        },
                        "shape": {
                            "comment": "Sets or retrieves the shape of the object."
                        }
                    }
                }
            },
            "HTMLButtonElement": {
                "properties": {
                    "property": {
                        "value": {
                            "comment": "Sets or retrieves the default or selected value of the control."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "type": {
                            "comment": "Gets the classification and default behavior of the button."
                        },
                        "validationMessage": {
                            "comment": "Returns the error message that would be displayed if the user submits the form, or an empty string if no error message. It also triggers the standard error message, such as \"this is a required field\". The result is that the user sees validation messages without actually submitting."
                        },
                        "formTarget": {
                            "comment": "Overrides the target attribute on a form element."
                        },
                        "willValidate": {
                            "comment": "Returns whether an element will successfully validate based on forms validation rules and constraints."
                        },
                        "formAction": {
                            "comment": "Overrides the action attribute (where the data on a form is sent) on the parent form element."
                        },
                        "validity": {
                            "comment": "Returns a  ValidityState object that represents the validity states of an element."
                        },
                        "formNoValidate": {
                            "comment": "Overrides any validation or required attributes on a form or form elements to allow it to be submitted without validation. This can be used to create a \"save draft\"-type submit option."
                        },
                        "formEnctype": {
                            "comment": "Used to override the encoding (formEnctype attribute) specified on the form element."
                        },
                        "formMethod": {
                            "comment": "Overrides the submit method attribute previously specified on a form element."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        },
                        "setCustomValidity": {
                            "comment": "Sets a custom error message that is displayed when a form is submitted.\n@param error Sets a custom error message that is displayed when a form is submitted."
                        }
                    }
                }
            },
            "HTMLSourceElement": {
                "properties": {
                    "property": {
                        "src": {
                            "comment": "The address or URL of the a media resource that is to be considered."
                        },
                        "media": {
                            "comment": "Gets or sets the intended media type of the media source."
                        },
                        "type": {
                            "comment": "Gets or sets the MIME type of a media resource."
                        }
                    }
                }
            },
            "Document": {
                "properties": {
                    "property": {
                        "implementation": {
                            "comment": "Gets the implementation object of the current document."
                        },
                        "scripts": {
                            "comment": "Retrieves a collection of all script objects in the document."
                        },
                        "charset": {
                            "comment": "Gets or sets the character set used to encode the object."
                        },
                        "vlinkColor": {
                            "comment": "Sets or gets the color of the links that the user has visited."
                        },
                        "title": {
                            "comment": "Contains the title of the document."
                        },
                        "embeds": {
                            "comment": "Retrieves a collection of all embed objects in the document."
                        },
                        "all": {
                            "comment": "Returns a reference to the collection of elements contained by the object."
                        },
                        "forms": {
                            "comment": "Retrieves a collection, in source order, of all form objects in the document."
                        },
                        "dir": {
                            "comment": "Sets or retrieves a value that indicates the reading order of the object."
                        },
                        "designMode": {
                            "comment": "Sets or gets a value that indicates whether the document can be edited."
                        },
                        "inputEncoding": {
                            "comment": "Returns the character encoding used to create the webpage that is loaded into the document object."
                        },
                        "links": {
                            "comment": "Retrieves a collection of all a objects that specify the href property and all area objects in the document."
                        },
                        "URL": {
                            "comment": "Sets or gets the URL for the current document."
                        },
                        "anchors": {
                            "comment": "Retrieves a collection of all a objects that have a name and/or id property. Objects in this collection are in HTML source order."
                        },
                        "readyState": {
                            "comment": "Retrieves a value that indicates the current state of the object."
                        },
                        "referrer": {
                            "comment": "Gets the URL of the location that referred the user to the current page."
                        },
                        "alinkColor": {
                            "comment": "Sets or gets the color of all active links in the document."
                        },
                        "doctype": {
                            "comment": "Gets an object representing the document type declaration associated with the current document."
                        },
                        "bgColor": {
                            "comment": "Deprecated. Sets or retrieves a value that indicates the background color behind the object."
                        },
                        "linkColor": {
                            "comment": "Sets or gets the color of the document links."
                        },
                        "applets": {
                            "comment": "Retrieves a collection of all applet objects in the document."
                        },
                        "body": {
                            "comment": "Specifies the beginning and end of the document body."
                        },
                        "domain": {
                            "comment": "Sets or gets the security domain of the document."
                        },
                        "documentElement": {
                            "comment": "Gets a reference to the root node of the document."
                        },
                        "images": {
                            "comment": "Retrieves a collection, in source order, of img objects in the document."
                        },
                        "location": {
                            "comment": "Contains information about the current URL."
                        },
                        "onreadystatechange": {
                            "comment": "Fires when the state of the object has changed.\n@param ev The event"
                        },
                        "lastModified": {
                            "comment": "Gets the date that the page was last modified, if the page supplies one."
                        },
                        "fgColor": {
                            "comment": "Sets or gets the foreground (text) color of the document."
                        },
                        "compatMode": {
                            "comment": "Gets a value that indicates whether standards-compliant mode is switched on for the object."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "queryCommandValue": {
                            "comment": "Returns the current value of the document, range, or current selection for the given command.\n@param commandId String that specifies a command identifier."
                        },
                        "queryCommandIndeterm": {
                            "comment": "Returns a Boolean value that indicates whether the specified command is in the indeterminate state.\n@param commandId String that specifies a command identifier."
                        },
                        "execCommand": {
                            "comment": "Executes a command on the current document, current selection, or the given range.\n@param commandId String that specifies the command to execute. This command can be any of the command identifiers that can be executed in script.\n@param showUI Display the user interface, defaults to false.\n@param value Value to assign."
                        },
                        "write": {
                            "comment": "Writes one or more HTML expressions to a document in the specified window.\n@param content Specifies the text and HTML tags to write."
                        },
                        "createElement": {
                            "comment": "Creates an instance of the element for the specified tag.\n@param tagName The name of an element."
                        },
                        "writeln": {
                            "comment": "Writes one or more HTML expressions, followed by a carriage return, to a document in the specified window.\n@param content The text and HTML tags to write."
                        },
                        "open": {
                            "comment": "Opens a new window and loads a document specified by a given URL. Also, opens a new window that uses the url parameter and the name parameter to collect the output of the write method and the writeln method.\n@param url Specifies a MIME type for the document.\n@param name Specifies the name of the window. This name is used as the value for the TARGET attribute on a form or an anchor element.\n@param features Contains a list of items separated by commas. Each item consists of an option and a value, separated by an equals sign (for example, \"fullscreen=yes, toolbar=yes\"). The following values are supported.\n@param replace Specifies whether the existing entry for the document is replaced in the history list."
                        },
                        "queryCommandSupported": {
                            "comment": "Returns a Boolean value that indicates whether the current command is supported on the current range.\n@param commandId Specifies a command identifier."
                        },
                        "createTreeWalker": {
                            "comment": "Creates a TreeWalker object that you can use to traverse filtered lists of nodes or elements in a document.\n@param root The root element or node to start traversing on.\n@param whatToShow The type of nodes or elements to appear in the node list. For more information, see whatToShow.\n@param filter A custom NodeFilter function to use."
                        },
                        "queryCommandEnabled": {
                            "comment": "Returns a Boolean value that indicates whether a specified command can be successfully executed using execCommand, given the current state of the document.\n@param commandId Specifies a command identifier."
                        },
                        "close": {
                            "comment": "Closes an output stream and forces the sent data to display."
                        },
                        "createRange": {
                            "comment": " Returns an empty range object that has both of its boundary points positioned at the beginning of the document."
                        },
                        "createComment": {
                            "comment": "Creates a comment object with the specified data.\n@param data Sets the comment object's data."
                        },
                        "getElementsByTagName": {
                            "comment": "Retrieves a collection of objects based on the specified element name.\n@param name Specifies the name of an element."
                        },
                        "createDocumentFragment": {
                            "comment": "Creates a new document."
                        },
                        "getElementsByName": {
                            "comment": "Gets a collection of objects based on the value of the NAME or ID attribute.\n@param elementName Gets a collection of objects based on the value of the NAME or ID attribute."
                        },
                        "queryCommandState": {
                            "comment": "Returns a Boolean value that indicates the current state of the command.\n@param commandId String that specifies a command identifier."
                        },
                        "hasFocus": {
                            "comment": "Gets a value indicating whether the object currently has focus."
                        },
                        "createAttribute": {
                            "comment": "Creates an attribute object with a specified name.\n@param name String that sets the attribute object's name."
                        },
                        "createTextNode": {
                            "comment": "Creates a text string from the specified value.\n@param data String that specifies the nodeValue property of the text node."
                        },
                        "createNodeIterator": {
                            "comment": "Creates a NodeIterator object that you can use to traverse filtered lists of nodes or elements in a document.\n@param root The root element or node to start traversing on.\n@param whatToShow The type of nodes or elements to appear in the node list\n@param filter A custom NodeFilter function to use. For more information, see filter. Use null for no filter."
                        },
                        "getSelection": {
                            "comment": "Returns an object representing the current selection of the document that is loaded into the object displaying a webpage."
                        },
                        "getElementById": {
                            "comment": "Returns a reference to the first object with the specified value of the ID attribute.\n@param elementId String that specifies the ID value."
                        }
                    }
                }
            },
            "HTMLScriptElement": {
                "properties": {
                    "property": {
                        "defer": {
                            "comment": "Sets or retrieves the status of the script."
                        },
                        "text": {
                            "comment": "Retrieves or sets the text of the object as a string."
                        },
                        "src": {
                            "comment": "Retrieves the URL to an external file that contains the source code or data."
                        },
                        "htmlFor": {
                            "comment": "Sets or retrieves the object that is bound to the event script."
                        },
                        "charset": {
                            "comment": "Sets or retrieves the character set used to encode the object."
                        },
                        "type": {
                            "comment": "Sets or retrieves the MIME type for the associated scripting engine."
                        },
                        "event": {
                            "comment": "Sets or retrieves the event for which the script is written."
                        }
                    }
                }
            },
            "HTMLTableRowElement": {
                "properties": {
                    "property": {
                        "rowIndex": {
                            "comment": "Retrieves the position of the object in the rows collection for the table."
                        },
                        "cells": {
                            "comment": "Retrieves a collection of all cells in the table row."
                        },
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        },
                        "sectionRowIndex": {
                            "comment": "Retrieves the position of the object in the collection."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "deleteCell": {
                            "comment": "Removes the specified cell from the table row, as well as from the cells collection.\n@param index Number that specifies the zero-based position of the cell to remove from the table row. If no value is provided, the last cell in the cells collection is deleted."
                        },
                        "insertCell": {
                            "comment": "Creates a new cell in the table row, and adds the cell to the cells collection.\n@param index Number that specifies where to insert the cell in the tr. The default value is -1, which appends the new cell to the end of the cells collection."
                        }
                    }
                }
            },
            "HTMLHtmlElement": {
                "properties": {
                    "property": {
                        "version": {
                            "comment": "Sets or retrieves the DTD version that governs the current document."
                        }
                    }
                }
            },
            "HTMLFrameElement": {
                "properties": {
                    "property": {
                        "scrolling": {
                            "comment": "Sets or retrieves whether the frame can be scrolled."
                        },
                        "marginHeight": {
                            "comment": "Sets or retrieves the top and bottom margin heights before displaying the text in a frame."
                        },
                        "marginWidth": {
                            "comment": "Sets or retrieves the left and right margin widths before displaying the text in a frame."
                        },
                        "frameBorder": {
                            "comment": "Sets or retrieves whether to display a border for the frame."
                        },
                        "noResize": {
                            "comment": "Sets or retrieves whether the user can resize the frame."
                        },
                        "contentWindow": {
                            "comment": "Retrieves the object of the specified."
                        },
                        "src": {
                            "comment": "Sets or retrieves a URL to be loaded by the object."
                        },
                        "name": {
                            "comment": "Sets or retrieves the frame name."
                        },
                        "contentDocument": {
                            "comment": "Retrieves the document object of the page or frame."
                        },
                        "longDesc": {
                            "comment": "Sets or retrieves a URI to a long description of the object."
                        }
                    }
                }
            },
            "HTMLQuoteElement": {
                "properties": {
                    "property": {
                        "cite": {
                            "comment": "Sets or retrieves reference information about the object."
                        }
                    }
                }
            },
            "HTMLFrameSetElement": {
                "properties": {
                    "property": {
                        "rows": {
                            "comment": "Sets or retrieves the frame heights of the object."
                        },
                        "cols": {
                            "comment": "Sets or retrieves the frame widths of the object."
                        }
                    }
                }
            },
            "HTMLLabelElement": {
                "properties": {
                    "property": {
                        "htmlFor": {
                            "comment": "Sets or retrieves the object to which the given label object is assigned."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        }
                    }
                }
            },
            "HTMLLegendElement": {
                "properties": {
                    "property": {
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        }
                    }
                }
            },
            "HTMLLIElement": {
                "properties": {
                    "property": {
                        "value": {
                            "comment": "Sets or retrieves the value of a list item."
                        }
                    }
                }
            },
            "HTMLIFrameElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "scrolling": {
                            "comment": "Sets or retrieves whether the frame can be scrolled."
                        },
                        "marginHeight": {
                            "comment": "Sets or retrieves the top and bottom margin heights before displaying the text in a frame."
                        },
                        "marginWidth": {
                            "comment": "Sets or retrieves the left and right margin widths before displaying the text in a frame."
                        },
                        "frameBorder": {
                            "comment": "Sets or retrieves whether to display a border for the frame."
                        },
                        "contentWindow": {
                            "comment": "Retrieves the object of the specified."
                        },
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        },
                        "src": {
                            "comment": "Sets or retrieves a URL to be loaded by the object."
                        },
                        "srcdoc": {
                            "comment": "Sets or retrives the content of the page that is to contain."
                        },
                        "name": {
                            "comment": "Sets or retrieves the frame name."
                        },
                        "height": {
                            "comment": "Sets or retrieves the height of the object."
                        },
                        "contentDocument": {
                            "comment": "Retrieves the document object of the page or frame."
                        },
                        "longDesc": {
                            "comment": "Sets or retrieves a URI to a long description of the object."
                        }
                    }
                }
            },
            "HTMLTableSectionElement": {
                "properties": {
                    "property": {
                        "align": {
                            "comment": "Sets or retrieves a value that indicates the table alignment."
                        },
                        "rows": {
                            "comment": "Sets or retrieves the number of horizontal rows contained in the object."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "deleteRow": {
                            "comment": "Removes the specified row (tr) from the element and from the rows collection.\n@param index Number that specifies the zero-based position in the rows collection of the row to remove."
                        },
                        "insertRow": {
                            "comment": "Creates a new row (tr) in the table, and adds the row to the rows collection.\n@param index Number that specifies where to insert the row in the rows collection. The default value is -1, which appends the new row to the end of the rows collection."
                        }
                    }
                }
            },
            "HTMLInputElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "selectionStart": {
                            "comment": "Gets or sets the starting position or offset of a text selection."
                        },
                        "selectionEnd": {
                            "comment": "Gets or sets the end position or offset of a text selection."
                        },
                        "accept": {
                            "comment": "Sets or retrieves a comma-separated list of content types."
                        },
                        "alt": {
                            "comment": "Sets or retrieves a text alternative to the graphic."
                        },
                        "defaultChecked": {
                            "comment": "Sets or retrieves the state of the check box or radio button."
                        },
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        },
                        "value": {
                            "comment": "Returns the value of the data at the cursor's current position."
                        },
                        "valueAsDate": {
                            "comment": "Returns a Date object representing the form control's value, if applicable; otherwise, returns null. Can be set, to change the value. Throws an \"InvalidStateError\" DOMException if the control isn't date- or time-based."
                        },
                        "src": {
                            "comment": "The address or URL of the a media resource that is to be considered."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "useMap": {
                            "comment": "Sets or retrieves the URL, often with a bookmark extension (#name), to use as a client-side image map."
                        },
                        "height": {
                            "comment": "Sets or retrieves the height of the object."
                        },
                        "checked": {
                            "comment": "Sets or retrieves the state of the check box or radio button."
                        },
                        "maxLength": {
                            "comment": "Sets or retrieves the maximum number of characters that the user can enter in a text control."
                        },
                        "type": {
                            "comment": "Returns the content type of the object."
                        },
                        "defaultValue": {
                            "comment": "Sets or retrieves the initial contents of the object."
                        },
                        "validationMessage": {
                            "comment": "Returns the error message that would be displayed if the user submits the form, or an empty string if no error message. It also triggers the standard error message, such as \"this is a required field\". The result is that the user sees validation messages without actually submitting."
                        },
                        "files": {
                            "comment": "Returns a FileList object on a file type input object."
                        },
                        "max": {
                            "comment": "Defines the maximum acceptable value for an input element with type=\"number\".When used with the min and step attributes, lets you control the range and increment (such as only even numbers) that the user can enter into an input field."
                        },
                        "formTarget": {
                            "comment": "Overrides the target attribute on a form element."
                        },
                        "willValidate": {
                            "comment": "Returns whether an element will successfully validate based on forms validation rules and constraints."
                        },
                        "step": {
                            "comment": "Defines an increment or jump between values that you want to allow the user to enter. When used with the max and min attributes, lets you control the range and increment (for example, allow only even numbers) that the user can enter into an input field."
                        },
                        "required": {
                            "comment": "When present, marks an element that can't be submitted without a value."
                        },
                        "formEnctype": {
                            "comment": "Used to override the encoding (formEnctype attribute) specified on the form element."
                        },
                        "valueAsNumber": {
                            "comment": "Returns the input field value as a number."
                        },
                        "placeholder": {
                            "comment": "Gets or sets a text string that is displayed in an input field as a hint or prompt to users as the format or type of information they need to enter.The text appears in an input field until the user puts focus on the field."
                        },
                        "formMethod": {
                            "comment": "Overrides the submit method attribute previously specified on a form element."
                        },
                        "list": {
                            "comment": "Specifies the ID of a pre-defined datalist of options for an input element."
                        },
                        "autocomplete": {
                            "comment": "Specifies whether autocomplete is applied to an editable text field."
                        },
                        "min": {
                            "comment": "Defines the minimum acceptable value for an input element with type=\"number\". When used with the max and step attributes, lets you control the range and increment (such as even numbers only) that the user can enter into an input field."
                        },
                        "formAction": {
                            "comment": "Overrides the action attribute (where the data on a form is sent) on the parent form element."
                        },
                        "pattern": {
                            "comment": "Gets or sets a string containing a regular expression that the user's input must match."
                        },
                        "validity": {
                            "comment": "Returns a  ValidityState object that represents the validity states of an element."
                        },
                        "formNoValidate": {
                            "comment": "Overrides any validation or required attributes on a form or form elements to allow it to be submitted without validation. This can be used to create a \"save draft\"-type submit option."
                        },
                        "multiple": {
                            "comment": "Sets or retrieves the Boolean value indicating whether multiple items can be selected from a list."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "setSelectionRange": {
                            "comment": "Sets the start and end positions of a selection in a text field.\n@param start The offset into the text field for the start of the selection.\n@param end The offset into the text field for the end of the selection.\n@param direction The direction in which the selection is performed."
                        },
                        "select": {
                            "comment": "Makes the selection equal to the current object."
                        },
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        },
                        "stepDown": {
                            "comment": "Decrements a range input control's value by the value given by the Step attribute. If the optional parameter is used, it will decrement the input control's step value multiplied by the parameter's value.\n@param n Value to decrement the value by."
                        },
                        "stepUp": {
                            "comment": "Increments a range input control's value by the value given by the Step attribute. If the optional parameter is used, will increment the input control's value by that value.\n@param n Value to increment the value by."
                        },
                        "setCustomValidity": {
                            "comment": "Sets a custom error message that is displayed when a form is submitted.\n@param error Sets a custom error message that is displayed when a form is submitted."
                        }
                    }
                }
            },
            "HTMLAnchorElement": {
                "properties": {
                    "property": {
                        "rel": {
                            "comment": "Sets or retrieves the relationship between the object and the destination of the link."
                        },
                        "coords": {
                            "comment": "Sets or retrieves the coordinates of the object."
                        },
                        "target": {
                            "comment": "Sets or retrieves the window or frame at which to target content."
                        },
                        "name": {
                            "comment": "Sets or retrieves the shape of the object."
                        },
                        "charset": {
                            "comment": "Sets or retrieves the character set used to encode the object."
                        },
                        "hreflang": {
                            "comment": "Sets or retrieves the language code of the object."
                        },
                        "rev": {
                            "comment": "Sets or retrieves the relationship between the object and the destination of the link."
                        },
                        "shape": {
                            "comment": "Sets or retrieves the shape of the object."
                        },
                        "text": {
                            "comment": "Retrieves or sets the text of the object as a string."
                        }
                    }
                }
            },
            "HTMLParamElement": {
                "properties": {
                    "property": {
                        "value": {
                            "comment": "Sets or retrieves the value of an input parameter for an element."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of an input parameter for an element."
                        },
                        "type": {
                            "comment": "Sets or retrieves the content type of the resource designated by the value attribute."
                        },
                        "valueType": {
                            "comment": "Sets or retrieves the data type of the value attribute."
                        }
                    }
                }
            },
            "HTMLPreElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or gets a value that you can use to implement your own width functionality for the object."
                        }
                    }
                }
            },
            "HTMLCanvasElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Gets or sets the width of a canvas element on a document."
                        },
                        "height": {
                            "comment": "Gets or sets the height of a canvas element on a document."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "toDataURL": {
                            "comment": "Returns the content of the current canvas as an image that you can use as a source for another canvas or an HTML element.\n@param type The standard MIME type for the image format to return. If you do not specify this parameter, the default value is a PNG format image."
                        },
                        "getContext": {
                            "comment": "Returns an object that provides methods and properties for drawing and manipulating images and graphics on a canvas element in a document. A context object includes information about colors, line widths, fonts, and other graphic parameters that can be drawn on a canvas.\n@param contextId The identifier (ID) of the type of canvas to create. Internet Explorer 9 and Internet Explorer 10 support only a 2-D context using canvas.getContext(\"2d\"); IE11 Preview also supports 3-D or WebGL context using canvas.getContext(\"experimental-webgl\");"
                        }
                    }
                }
            },
            "HTMLTitleElement": {
                "properties": {
                    "property": {
                        "text": {
                            "comment": "Retrieves or sets the text of the object as a string."
                        }
                    }
                }
            },
            "HTMLStyleElement": {
                "properties": {
                    "property": {
                        "media": {
                            "comment": "Sets or retrieves the media type."
                        },
                        "type": {
                            "comment": "Retrieves the CSS language in which the style sheet is written."
                        },
                        "disabled": {
                            "comment": "Enables or disables the style sheet."
                        }
                    }
                }
            },
            "HTMLTableCellElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "headers": {
                            "comment": "Sets or retrieves a list of header cells that provide information for the object."
                        },
                        "cellIndex": {
                            "comment": "Retrieves the position of the object in the cells collection of a row."
                        },
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        },
                        "colSpan": {
                            "comment": "Sets or retrieves the number columns in the table that the object should span."
                        },
                        "axis": {
                            "comment": "Sets or retrieves a comma-delimited list of conceptual categories associated with the object."
                        },
                        "height": {
                            "comment": "Sets or retrieves the height of the object."
                        },
                        "noWrap": {
                            "comment": "Sets or retrieves whether the browser automatically performs wordwrap."
                        },
                        "abbr": {
                            "comment": "Sets or retrieves abbreviated text for the object."
                        },
                        "rowSpan": {
                            "comment": "Sets or retrieves how many rows in a table the cell should span."
                        },
                        "scope": {
                            "comment": "Sets or retrieves the group of cells in a table to which the object's information applies."
                        }
                    }
                }
            },
            "HTMLTextAreaElement": {
                "properties": {
                    "property": {
                        "value": {
                            "comment": "Retrieves or sets the text in the entry field of the textArea element."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "selectionStart": {
                            "comment": "Gets or sets the starting position or offset of a text selection."
                        },
                        "rows": {
                            "comment": "Sets or retrieves the number of horizontal rows contained in the object."
                        },
                        "cols": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "readOnly": {
                            "comment": "Sets or retrieves the value indicated whether the content of the object is read-only."
                        },
                        "wrap": {
                            "comment": "Sets or retrieves how to handle wordwrapping in the object."
                        },
                        "selectionEnd": {
                            "comment": "Gets or sets the end position or offset of a text selection."
                        },
                        "type": {
                            "comment": "Retrieves the type of control."
                        },
                        "defaultValue": {
                            "comment": "Sets or retrieves the initial contents of the object."
                        },
                        "validationMessage": {
                            "comment": "Returns the error message that would be displayed if the user submits the form, or an empty string if no error message. It also triggers the standard error message, such as \"this is a required field\". The result is that the user sees validation messages without actually submitting."
                        },
                        "validity": {
                            "comment": "Returns a  ValidityState object that represents the validity states of an element."
                        },
                        "required": {
                            "comment": "When present, marks an element that can't be submitted without a value."
                        },
                        "maxLength": {
                            "comment": "Sets or retrieves the maximum number of characters that the user can enter in a text control."
                        },
                        "willValidate": {
                            "comment": "Returns whether an element will successfully validate based on forms validation rules and constraints."
                        },
                        "placeholder": {
                            "comment": "Gets or sets a text string that is displayed in an input field as a hint or prompt to users as the format or type of information they need to enter.The text appears in an input field until the user puts focus on the field."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "setSelectionRange": {
                            "comment": "Sets the start and end positions of a selection in a text field.\n@param start The offset into the text field for the start of the selection.\n@param end The offset into the text field for the end of the selection.\n@param direction The direction in which the selection is performed."
                        },
                        "select": {
                            "comment": "Highlights the input area of a form element."
                        },
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        },
                        "setCustomValidity": {
                            "comment": "Sets a custom error message that is displayed when a form is submitted.\n@param error Sets a custom error message that is displayed when a form is submitted."
                        }
                    }
                }
            },
            "HTMLModElement": {
                "properties": {
                    "property": {
                        "dateTime": {
                            "comment": "Sets or retrieves the date and time of a modification to the object."
                        },
                        "cite": {
                            "comment": "Sets or retrieves reference information about the object."
                        }
                    }
                }
            },
            "HTMLTableColElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "align": {
                            "comment": "Sets or retrieves the alignment of the object relative to the display or table."
                        },
                        "span": {
                            "comment": "Sets or retrieves the number of columns in the group."
                        }
                    }
                }
            },
            "HTMLDivElement": {
                "properties": {
                    "property": {
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        }
                    }
                }
            },
            "HTMLBRElement": {
                "properties": {
                    "property": {
                        "clear": {
                            "comment": "Sets or retrieves the side on which floating objects are not to be positioned when any IHTMLBlockElement is inserted into the document."
                        }
                    }
                }
            },
            "HTMLHeadingElement": {
                "properties": {
                    "property": {
                        "align": {
                            "comment": "Sets or retrieves a value that indicates the table alignment."
                        }
                    }
                }
            },
            "HTMLFormElement": {
                "properties": {
                    "property": {
                        "length": {
                            "comment": "Sets or retrieves the number of objects in a collection."
                        },
                        "target": {
                            "comment": "Sets or retrieves the window or frame at which to target content."
                        },
                        "acceptCharset": {
                            "comment": "Sets or retrieves a list of character encodings for input data that must be accepted by the server processing the form."
                        },
                        "enctype": {
                            "comment": "Sets or retrieves the encoding type for the form."
                        },
                        "elements": {
                            "comment": "Retrieves a collection, in source order, of all controls in a given form."
                        },
                        "action": {
                            "comment": "Sets or retrieves the URL to which the form content is sent for processing."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "method": {
                            "comment": "Sets or retrieves how to send the form data to the server."
                        },
                        "encoding": {
                            "comment": "Sets or retrieves the MIME encoding for the form."
                        },
                        "autocomplete": {
                            "comment": "Specifies whether autocomplete is applied to an editable text field."
                        },
                        "noValidate": {
                            "comment": "Designates a form that is not validated when submitted."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "reset": {
                            "comment": "Fires when the user resets a form."
                        },
                        "submit": {
                            "comment": "Fires when a FORM is about to be submitted."
                        },
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        }
                    }
                }
            },
            "HTMLMediaElement": {
                "properties": {
                    "property": {
                        "played": {
                            "comment": "Gets TimeRanges for the current media resource that has been played."
                        },
                        "currentSrc": {
                            "comment": "Gets the address or URL of the current media resource that is selected by IHTMLMediaElement."
                        },
                        "loop": {
                            "comment": "Gets or sets a flag to specify whether playback should restart after it completes."
                        },
                        "ended": {
                            "comment": "Gets information about whether the playback has ended or not."
                        },
                        "buffered": {
                            "comment": "Gets a collection of buffered time ranges."
                        },
                        "error": {
                            "comment": "Returns an object representing the current error state of the audio or video element."
                        },
                        "seekable": {
                            "comment": "Returns a TimeRanges object that represents the ranges of the current media resource that can be seeked."
                        },
                        "autoplay": {
                            "comment": "Gets or sets a value that indicates whether to start playing the media automatically."
                        },
                        "controls": {
                            "comment": "Gets or sets a flag that indicates whether the client provides a set of controls for the media (in case the developer does not include controls for the player)."
                        },
                        "volume": {
                            "comment": "Gets or sets the volume level for audio portions of the media element."
                        },
                        "src": {
                            "comment": "The address or URL of the a media resource that is to be considered."
                        },
                        "playbackRate": {
                            "comment": "Gets or sets the current rate of speed for the media resource to play. This speed is expressed as a multiple of the normal speed of the media resource."
                        },
                        "duration": {
                            "comment": "Returns the duration in seconds of the current media resource. A NaN value is returned if duration is not available, or Infinity if the media resource is streaming."
                        },
                        "muted": {
                            "comment": "Gets or sets a flag that indicates whether the audio (either audio or the audio track on video media) is muted."
                        },
                        "defaultPlaybackRate": {
                            "comment": "Gets or sets the default playback rate when the user is not using fast forward or reverse for a video or audio resource."
                        },
                        "paused": {
                            "comment": "Gets a flag that specifies whether playback is paused."
                        },
                        "seeking": {
                            "comment": "Gets a flag that indicates whether the client is currently moving to a new playback position in the media resource."
                        },
                        "currentTime": {
                            "comment": "Gets or sets the current playback position, in seconds."
                        },
                        "preload": {
                            "comment": "Gets or sets a value indicating what data should be preloaded, if any."
                        },
                        "networkState": {
                            "comment": "Gets the current network activity for the element."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "pause": {
                            "comment": "Pauses the current playback and sets paused to TRUE."
                        },
                        "play": {
                            "comment": "Loads and starts playback of a media resource."
                        },
                        "load": {
                            "comment": "Resets the audio or video object and loads a new media resource."
                        },
                        "canPlayType": {
                            "comment": "Returns a string that specifies whether the client can play a given media resource type."
                        }
                    }
                }
            },
            "HTMLFieldSetElement": {
                "properties": {
                    "property": {
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "validationMessage": {
                            "comment": "Returns the error message that would be displayed if the user submits the form, or an empty string if no error message. It also triggers the standard error message, such as \"this is a required field\". The result is that the user sees validation messages without actually submitting."
                        },
                        "validity": {
                            "comment": "Returns a  ValidityState object that represents the validity states of an element."
                        },
                        "willValidate": {
                            "comment": "Returns whether an element will successfully validate based on forms validation rules and constraints."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        },
                        "setCustomValidity": {
                            "comment": "Sets a custom error message that is displayed when a form is submitted.\n@param error Sets a custom error message that is displayed when a form is submitted."
                        }
                    }
                }
            },
            "HTMLHRElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "align": {
                            "comment": "Sets or retrieves how the object is aligned with adjacent text."
                        },
                        "noShade": {
                            "comment": "Sets or retrieves whether the horizontal rule is drawn with 3-D shading."
                        }
                    }
                }
            },
            "HTMLObjectElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "codeType": {
                            "comment": "Sets or retrieves the Internet media type for the code associated with the object."
                        },
                        "form": {
                            "comment": "Retrieves a reference to the form that the object is embedded in."
                        },
                        "code": {
                            "comment": "Sets or retrieves the URL of the file containing the compiled Java class."
                        },
                        "archive": {
                            "comment": "Sets or retrieves a character string that can be used to implement your own archive functionality for the object."
                        },
                        "standby": {
                            "comment": "Sets or retrieves a message to be displayed while an object is loading."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "useMap": {
                            "comment": "Sets or retrieves the URL, often with a bookmark extension (#name), to use as a client-side image map."
                        },
                        "data": {
                            "comment": "Sets or retrieves the URL that references the data of the object."
                        },
                        "height": {
                            "comment": "Sets or retrieves the height of the object."
                        },
                        "contentDocument": {
                            "comment": "Retrieves the document object of the page or frame."
                        },
                        "codeBase": {
                            "comment": "Sets or retrieves the URL of the component."
                        },
                        "type": {
                            "comment": "Sets or retrieves the MIME type of the object."
                        },
                        "validationMessage": {
                            "comment": "Returns the error message that would be displayed if the user submits the form, or an empty string if no error message. It also triggers the standard error message, such as \"this is a required field\". The result is that the user sees validation messages without actually submitting."
                        },
                        "validity": {
                            "comment": "Returns a  ValidityState object that represents the validity states of an element."
                        },
                        "willValidate": {
                            "comment": "Returns whether an element will successfully validate based on forms validation rules and constraints."
                        }
                    }
                },
                "methods": {
                    "method": {
                        "checkValidity": {
                            "comment": "Returns whether a form will validate when it is submitted, without having to submit it."
                        },
                        "setCustomValidity": {
                            "comment": "Sets a custom error message that is displayed when a form is submitted.\n@param error Sets a custom error message that is displayed when a form is submitted."
                        }
                    }
                }
            },
            "HTMLEmbedElement": {
                "properties": {
                    "property": {
                        "width": {
                            "comment": "Sets or retrieves the width of the object."
                        },
                        "src": {
                            "comment": "Sets or retrieves a URL to be loaded by the object."
                        },
                        "name": {
                            "comment": "Sets or retrieves the name of the object."
                        },
                        "height": {
                            "comment": "Sets or retrieves the height of the object."
                        }
                    }
                }
            },
            "HTMLOptGroupElement": {
                "properties": {
                    "property": {
                        "label": {
                            "comment": "Sets or retrieves a value that you can use to implement your own label functionality for the object."
                        }
                    }
                }
            },
            "HTMLVideoElement": {
                "properties": {
                    "property": {
                        "playsInline": {
                            "comment": "Gets or sets the playsinline of the video element. for example, On iPhone, video elements will now be allowed to play inline, and will not automatically enter fullscreen mode when playback begins."
                        },
                        "width": {
                            "comment": "Gets or sets the width of the video element."
                        },
                        "videoWidth": {
                            "comment": "Gets the intrinsic width of a video in CSS pixels, or zero if the dimensions are not known."
                        },
                        "videoHeight": {
                            "comment": "Gets the intrinsic height of a video in CSS pixels, or zero if the dimensions are not known."
                        },
                        "height": {
                            "comment": "Gets or sets the height of the video element."
                        },
                        "poster": {
                            "comment": "Gets or sets a URL of an image to display, for example, like a movie poster. This can be a still frame from the video, or another image if no video data is available."
                        }
                    }
                }
            },
            "HTMLProgressElement": {
                "properties": {
                    "property": {
                        "value": {
                            "comment": "Sets or gets the current value of a progress element. The value must be a non-negative number between 0 and the max value."
                        },
                        "max": {
                            "comment": "Defines the maximum, or \"done\" value for a progress element."
                        },
                        "position": {
                            "comment": "Returns the quotient of value/max when the value attribute is set (determinate progress bar), or -1 when the value attribute is missing (indeterminate progress bar)."
                        }
                    }
                }
            },
            "URLSearchParams": {
                "methods": {
                    "method": {
                        "append": {
                            "comment": "Appends a specified key/value pair as a new search parameter."
                        },
                        "delete": {
                            "comment": "Deletes the given search parameter, and its associated value, from the list of all search parameters."
                        },
                        "get": {
                            "comment": "Returns the first value associated to the given search parameter."
                        },
                        "getAll": {
                            "comment": "Returns all the values association with a given search parameter."
                        },
                        "has": {
                            "comment": "Returns a Boolean indicating if such a search parameter exists."
                        },
                        "set": {
                            "comment": "Sets the value associated to a given search parameter to the given value. If there were several values, delete the others."
                        },
                        "toString": {
                            "comment": "Returns a string containing a query string suitable for use in a URL. Does not include the question mark."
                        }
                    },
                    "constructor": "Constructor returning a URLSearchParams object."
                },
                "iterator": {
                    "comments": {
                        "comment": {
                            "entries": "Returns an array of key, value pairs for every entry in the search params.",
                            "keys": "Returns a list of keys in the search params.",
                            "values": "Returns a list of values in the search params."
                        }
                    }
                }
            },
            "ShadowRoot": {
                "methods": {
                    "method": {
                        "cloneNode": {
                            "comment": "Throws a \"NotSupportedError\" DOMException if context object is a shadow root."
                        }
                    }
                }
            },
            "Window": {
                "properties": {
                    "property": {
                        "parent": {
                            "comment": "Refers to either the parent WindowProxy, or itself.\n\nIt can rarely be null e.g. for contentWindow of an iframe that is already removed from the parent."
                        }
                    }
                }
            }
        }
    }
}