{
    "event-type": "Returns the type of event, e.g.\n\"click\", \"hashchange\", or\n\"submit\".",
    "event-target": "Returns the object to which event is dispatched (its target).",
    "event-currenttarget": "Returns the object whose event listener's callback is currently being\ninvoked.",
    "event-stoppropagation": "When dispatched in a tree, invoking this method prevents event from reaching any objects other than the current object.",
    "event-stopimmediatepropagation": "Invoking this method prevents event from reaching\nany registered event listeners after the current one finishes running and, when dispatched in a tree, also prevents event from reaching any\nother objects.",
    "event-bubbles": "Returns true or false depending on how event was initialized. True if event goes through its target's ancestors in reverse tree order, and false otherwise.",
    "event-composed": "Returns true or false depending on how event was initialized. True if event invokes listeners past a ShadowRoot node that is the root of its target, and false otherwise.",
    "event-istrusted": "Returns true if event was dispatched by the user agent, and\nfalse otherwise.",
    "event-timestamp": "Returns the event's timestamp as the number of milliseconds measured relative to\nthe time origin.",
    "customevent-detail": "Returns any custom data event was created with.\nTypically used for synthetic events.",
    "eventtarget-eventtarget": "Creates a new EventTarget object, which can be used by developers to dispatch and\nlisten for events.",
    "eventtarget-addeventlistener": "Appends an event listener for events whose type attribute value is type. The callback argument sets the callback that will be invoked when the event is dispatched.\nThe options argument sets listener-specific options. For compatibility this can be a\nboolean, in which case the method behaves exactly as if the value was specified as options's capture.\nWhen set to true, options's capture prevents callback from being invoked when the event's eventPhase attribute value is BUBBLING_PHASE. When false (or not present), callback will not be invoked when event's eventPhase attribute value is CAPTURING_PHASE. Either way, callback will be invoked if event's eventPhase attribute value is AT_TARGET.\nWhen set to true, options's passive indicates that the callback will not cancel the event by invoking preventDefault(). This is used to enable performance optimizations described in §2.8 Observing event listeners.\nWhen set to true, options's once indicates that the callback will only be invoked once after which the event listener will\nbe removed.\nThe event listener is appended to target's event listener list and is not appended if it has the same type, callback, and capture.",
    "eventtarget-removeeventlistener": "Removes the event listener in target's event listener list with the same type, callback, and options.",
    "eventtarget-dispatchevent": "Dispatches a synthetic event event to target and returns true\nif either event's cancelable attribute value is false or its preventDefault() method was not invoked, and false otherwise.",
    "abortcontroller-signal": "Returns the AbortSignal object associated with this object.",
    "abortcontroller-abort": "Invoking this method will set this object's AbortSignal's aborted flag and\nsignal to any observers that the associated activity is to be aborted.",
    "abortsignal-aborted": "Returns true if this AbortSignal's AbortController has signaled to abort, and false\notherwise.",
    "nonelementparentnode-getelementbyid": "Returns the first element within node's descendants whose ID is elementId.",
    "parentnode-children": "Returns the child elements.",
    "parentnode-firstelementchild": "Returns the first child that is an element, and null otherwise.",
    "parentnode-lastelementchild": "Returns the last child that is an element, and null otherwise.",
    "parentnode-prepend": "Inserts nodes before the first child of node, while\nreplacing strings in nodes with equivalent Text nodes.\nThrows a \"HierarchyRequestError\" DOMException if the constraints of\nthe node tree are violated.",
    "parentnode-append": "Inserts nodes after the last child of node, while replacing\nstrings in nodes with equivalent Text nodes.\nThrows a \"HierarchyRequestError\" DOMException if the constraints of\nthe node tree are violated.",
    "parentnode-queryselector": "Returns the first element that is a descendant of node that\nmatches selectors.",
    "parentnode-queryselectorall": "Returns all element descendants of node that\nmatch selectors.",
    "nondocumenttypechildnode-previouselementsibling": "Returns the first preceding sibling that\nis an element, and null otherwise.",
    "nondocumenttypechildnode-nextelementsibling": "Returns the first following sibling that\nis an element, and null otherwise.",
    "childnode-before": "Inserts nodes just before node, while replacing strings in nodes with equivalent Text nodes.\nThrows a \"HierarchyRequestError\" DOMException if the constraints of\nthe node tree are violated.",
    "childnode-after": "Inserts nodes just after node, while replacing strings in nodes with equivalent Text nodes.\nThrows a \"HierarchyRequestError\" DOMException if the constraints of\nthe node tree are violated.",
    "childnode-replacewith": "Replaces node with nodes, while replacing strings in nodes with equivalent Text nodes.\nThrows a \"HierarchyRequestError\" DOMException if the constraints of\nthe node tree are violated.",
    "childnode-remove": "Removes node.",
    "nodelist-length": "Returns the number of nodes in the collection.",
    "nodelist-item": "element = collection[index]",
    "htmlcollection-length": "Returns the number of elements in\nthe collection.",
    "htmlcollection-item": "element = collection[index]",
    "htmlcollection-nameditem": "element = collection[name]",
    "mutationobserver-observe": "Instructs the user agent to observe a given target (a node) and report any mutations based on\nthe criteria given by options (an object).\nThe options argument allows for setting mutation\nobservation options via object members. These are the object members that\ncan be used:\nchildList\nSet to true if mutations to target's children are to be observed.\nattributes\nSet to true if mutations to target's attributes are to be observed. Can be omitted if attributeOldValue or attributeFilter is\nspecified.\ncharacterData\nSet to true if mutations to target's data are to be observed. Can be omitted if characterDataOldValue is specified.\nsubtree\nSet to true if mutations to not just target, but\nalso target's descendants are to be\nobserved.\nattributeOldValue\nSet to true if attributes is true or omitted\nand target's attribute value before the mutation\nneeds to be recorded.\ncharacterDataOldValue\nSet to true if characterData is set to true or omitted and target's data before the mutation\nneeds to be recorded.\nattributeFilter\nSet to a list of attribute local names (without namespace) if not all attribute mutations need to be\nobserved and attributes is true\nor omitted.",
    "mutationobserver-takerecords": "Empties the record queue and\nreturns what was in there.",
    "mutationrecord-type": "Returns \"attributes\" if it was an attribute mutation.\n\"characterData\" if it was a mutation to a CharacterData node. And\n\"childList\" if it was a mutation to the tree of nodes.",
    "mutationrecord-removednodes": "Return the nodes added and removed\nrespectively.",
    "mutationrecord-nextsibling": "Return the previous and next sibling respectively\nof the added or removed nodes, and null otherwise.",
    "mutationrecord-attributename": "Returns the local name of the\nchanged attribute, and null otherwise.",
    "mutationrecord-attributenamespace": "Returns the namespace of the\nchanged attribute, and null otherwise.",
    "mutationrecord-oldvalue": "The return value depends on type. For\n\"attributes\", it is the value of the\nchanged attribute before the change.\nFor \"characterData\", it is the data of the changed node before the change. For\n\"childList\", it is null.",
    "node-nodename": "Returns a string appropriate for the type of node, as\nfollows:\nElement\nIts HTML-uppercased qualified name.\nAttr\nIts qualified name.\nText\n\"#text\".\nCDATASection\n\"#cdata-section\".\nProcessingInstruction\nIts target.\nComment\n\"#comment\".\nDocument\n\"#document\".\nDocumentType\nIts name.\nDocumentFragment\n\"#document-fragment\".",
    "node-baseuri": "Returns node's node document's document base URL.",
    "node-isconnected": "Returns true if node is connected and false otherwise.",
    "node-ownerdocument": "Returns the node document.\nReturns null for documents.",
    "node-getrootnode": "Returns node's shadow-including root.",
    "node-parentnode": "Returns the parent.",
    "node-parentelement": "Returns the parent element.",
    "node-haschildnodes": "Returns whether node has children.",
    "node-childnodes": "Returns the children.",
    "node-firstchild": "Returns the first child.",
    "node-lastchild": "Returns the last child.",
    "node-previoussibling": "Returns the previous sibling.",
    "node-nextsibling": "Returns the next sibling.",
    "node-normalize": "Removes empty exclusive Text nodes and concatenates the data of remaining contiguous exclusive Text nodes into the first of their nodes.",
    "node-clonenode": "Returns a copy of node. If deep is true, the copy also includes the node's descendants.",
    "node-isequalnode": "Returns whether node and otherNode have the same properties.",
    "node-contains": "Returns true if other is an inclusive descendant of node, and false otherwise.",
    "document-document": "Returns a new document.",
    "document-implementation": "Returns a document, with a basic tree already constructed including a title element, unless the title argument is omitted.",
    "document-documenturi": "Returns document's URL.",
    "document-origin": "Returns document's origin.",
    "document-compatmode": "Returns the string \"BackCompat\" if document's mode is \"quirks\", and \"CSS1Compat\"\notherwise.",
    "document-characterset": "Returns document's encoding.",
    "document-contenttype": "Returns document's content type.",
    "document-doctype": "Returns the doctype or null if\nthere is none.",
    "document-documentelement": "Returns the document element.",
    "document-getelementsbytagname": "If qualifiedName is \"*\" returns a HTMLCollection of all descendant elements.\nOtherwise, returns a HTMLCollection of all descendant elements whose qualified name is qualifiedName. (Matches case-insensitively against elements in the HTML namespace within an HTML document.)",
    "document-getelementsbytagnamens": "If namespace and localName are\n\"*\" returns a HTMLCollection of all descendant elements.\nIf only namespace is \"*\" returns a HTMLCollection of all descendant elements whose local name is localName.\nIf only localName is \"*\" returns a HTMLCollection of all descendant elements whose namespace is namespace.\nOtherwise, returns a HTMLCollection of all descendant elements whose namespace is namespace and local name is localName.",
    "document-getelementsbyclassname": "collection = element . getElementsByClassName(classNames)",
    "document-createelement": "Returns an element with localName as local name (if document is an HTML document, localName gets lowercased). The element's namespace is the HTML namespace when document is an HTML document or document's content type is \"application/xhtml+xml\", and null otherwise.\nIf localName does not match the Name production an\n\"InvalidCharacterError\" DOMException will be thrown.\nWhen supplied, options's is can be used to create a customized built-in element.",
    "document-createelementns": "Returns an element with namespace namespace. Its namespace prefix will be everything before \":\" (U+003E) in qualifiedName or null. Its local name will be everything after\n\":\" (U+003E) in qualifiedName or qualifiedName.\nIf localName does not match the Name production an\n\"InvalidCharacterError\" DOMException will be thrown.\nIf one of the following conditions is true a \"NamespaceError\" DOMException will be thrown:\nlocalName does not match the QName production.\nNamespace prefix is not null and namespace is the empty string.\nNamespace prefix is \"xml\" and namespace is not the XML namespace.\nqualifiedName or namespace prefix is \"xmlns\" and namespace is not the XMLNS namespace.\nnamespace is the XMLNS namespace and\nneither qualifiedName nor namespace prefix is \"xmlns\".\nWhen supplied, options's is can be used to create a customized built-in element.",
    "document-createdocumentfragment": "Returns a DocumentFragment node.",
    "document-createtextnode": "Returns a Text node whose data is data.",
    "document-createcdatasection": "Returns a CDATASection node whose data is data.",
    "document-createcomment": "Returns a Comment node whose data is data.",
    "document-createprocessinginstruction": "Returns a ProcessingInstruction node whose target is target and data is data.\nIf target does not match the Name production an\n\"InvalidCharacterError\" DOMException will be thrown.\nIf data contains \"?>\" an\n\"InvalidCharacterError\" DOMException will be thrown.",
    "document-importnode": "Returns a copy of node. If deep is true, the copy also includes the node's descendants.\nIf node is a document or a shadow root, throws a\n\"NotSupportedError\" DOMException.",
    "document-adoptnode": "Moves node from another document and returns it.\nIf node is a document, throws a \"NotSupportedError\" DOMException or, if node is a shadow root, throws a\n\"HierarchyRequestError\" DOMException.",
    "documentfragment-documentfragment": "Returns a new DocumentFragment node.",
    "element-namespaceuri": "Returns the namespace.",
    "element-prefix": "Returns the namespace prefix.",
    "element-localname": "Returns the local name.",
    "element-tagname": "Returns the HTML-uppercased qualified name.",
    "element-id": "Returns the value of element's id content attribute. Can be set to\nchange it.",
    "element-classname": "Returns the value of element's class content attribute. Can be set\nto change it.",
    "element-classlist": "Allows for manipulation of element's class content attribute as a\nset of whitespace-separated tokens through a DOMTokenList object.",
    "element-slot": "Returns the value of element's slot content attribute. Can be set to\nchange it.",
    "element-hasattributes": "Returns true if element has attributes, and false otherwise.",
    "element-getattributenames": "Returns the qualified names of all element's attributes.\nCan contain duplicates.",
    "element-getattribute": "Returns element's first attribute whose qualified name is qualifiedName, and null if there is no such attribute otherwise.",
    "element-getattributens": "Returns element's attribute whose namespace is namespace and local name is localName, and null if there is\nno such attribute otherwise.",
    "element-setattribute": "Sets the value of element's first attribute whose qualified name is qualifiedName to value.",
    "element-setattributens": "Sets the value of element's attribute whose namespace is namespace and local name is localName to value.",
    "element-removeattribute": "Removes element's first attribute whose qualified name is qualifiedName.",
    "element-removeattributens": "Removes element's attribute whose namespace is namespace and local name is localName.",
    "element-toggleattribute": "If force is not given, \"toggles\" qualifiedName, removing it if it is\npresent and adding it if it is not present. If force is true, adds qualifiedName. If force is false, removes qualifiedName.\nReturns true if qualifiedName is now present, and false otherwise.",
    "element-hasattribute": "Returns true if element has an attribute whose qualified name is qualifiedName, and false otherwise.",
    "element-hasattributens": "Returns true if element has an attribute whose namespace is namespace and local name is localName.",
    "element-attachshadow": "Creates a shadow root for element and returns it.",
    "element-shadowroot": "Returns element's shadow root, if any, and if shadow root's mode is \"open\", and null otherwise.",
    "element-closest": "Returns the first (starting at element) inclusive ancestor that matches selectors, and null otherwise.",
    "element-matches": "Returns true if matching selectors against element's root yields element, and false otherwise.",
    "text-text": "Returns a new Text node whose data is data.",
    "text-splittext": "Splits data at the given offset and returns the remainder as Text node.",
    "text-wholetext": "Returns the combined data of all direct Text node siblings.",
    "comment-comment": "Returns a new Comment node whose data is data.",
    "range-startcontainer": "Returns range's start node.",
    "range-startoffset": "Returns range's start offset.",
    "range-endcontainer": "Returns range's end node.",
    "range-endoffset": "Returns range's end offset.",
    "range-collapsed": "Returns true if range is collapsed, and false otherwise.",
    "range-range": "Returns a new live range.",
    "range-commonancestorcontainer": "Returns the node, furthest away from\nthe document, that is an ancestor of both range's start node and end node.",
    "range-comparepoint": "Returns −1 if the point is before the range, 0 if the point is\nin the range, and 1 if the point is after the range.",
    "range-intersectsnode": "Returns whether range intersects node.",
    "domtokenlist-length": "Returns the number of tokens.",
    "domtokenlist-item": "tokenlist[index]",
    "domtokenlist-contains": "Returns true if token is present, and false otherwise.",
    "domtokenlist-add": "Adds all arguments passed, except those already present.\nThrows a \"SyntaxError\" DOMException if one of the arguments is the empty\nstring.\nThrows an \"InvalidCharacterError\" DOMException if one of the arguments\ncontains any ASCII whitespace.",
    "domtokenlist-remove": "Removes arguments passed, if they are present.\nThrows a \"SyntaxError\" DOMException if one of the arguments is the empty\nstring.\nThrows an \"InvalidCharacterError\" DOMException if one of the arguments\ncontains any ASCII whitespace.",
    "domtokenlist-replace": "Replaces token with newToken.\nReturns true if token was replaced with newToken, and false otherwise.\nThrows a \"SyntaxError\" DOMException if one of the arguments is the empty\nstring.\nThrows an \"InvalidCharacterError\" DOMException if one of the arguments\ncontains any ASCII whitespace.",
    "domtokenlist-supports": "Returns true if token is in the associated attribute's supported tokens. Returns\nfalse otherwise.\nThrows a TypeError if the associated attribute has no supported tokens defined.",
    "domtokenlist-value": "Returns the associated set as string.\nCan be set, to change the associated attribute."
}
