{
    "request": "Returns a new request whose url property is input if input is a string, and input's url if input is a Request object.\n\nThe init argument is an object whose properties can be set as follows:",
    "request-method": "Returns request's HTTP method, which is \"GET\" by default.",
    "request-url": "Returns the URL of request as a string.",
    "request-headers": "Returns a Headers object consisting of the headers associated with request. Note that headers added in the network layer by the user agent will not be accounted for in this object, e.g., the \"Host\" header.",
    "request-destination": "Returns the kind of resource requested by request, e.g., \"document\" or \"script\".",
    "request-referrer": "Returns the referrer of request. Its value can be a same-origin URL if explicitly set in init, the empty string to indicate no referrer, and \"about:client\" when defaulting to the global's default. This is used during fetching to determine the value of the `Referer` header of the request being made.",
    "request-referrerpolicy": "Returns the referrer policy associated with request. This is used during fetching to compute the value of the request's referrer.",
    "request-mode": "Returns the mode associated with request, which is a string indicating whether the request will use CORS, or will be restricted to same-origin URLs.",
    "request-credentials": "Returns the credentials mode associated with request, which is a string indicating whether credentials will be sent with the request always, never, or only when sent to a same-origin URL.",
    "request-cache": "Returns the cache mode associated with request, which is a string indicating how the request will interact with the browser's cache when fetching.",
    "request-redirect": "Returns the redirect mode associated with request, which is a string indicating how redirects for the request will be handled during fetching. A request will follow redirects by default.",
    "request-integrity": "Returns request's subresource integrity metadata, which is a cryptographic hash of the resource being fetched. Its value consists of multiple hashes separated by whitespace. [SRI]",
    "request-keepalive": "Returns a boolean indicating whether or not request can outlive the global in which it was created.",
    "request-isreloadnavigation": "Returns a boolean indicating whether or not request is for a reload navigation.",
    "request-ishistorynavigation": "Returns a boolean indicating whether or not request is for a history navigation (a.k.a. back-foward navigation).",
    "request-signal": "Returns the signal associated with request, which is an AbortSignal object indicating whether or not request has been aborted, and its abort event handler.",
    "requestinit-method": "A string to set request's method.",
    "requestinit-headers": "A Headers object, an object literal, or an array of two-item arrays to set request's headers.",
    "requestinit-body": "A BodyInit object or null to set request's body.",
    "requestinit-referrer": "A string whose value is a same-origin URL, \"about:client\", or the empty string, to set request's referrer.",
    "requestinit-referrerpolicy": "A referrer policy to set request's referrerPolicy.",
    "requestinit-mode": "A string to indicate whether the request will use CORS, or will be restricted to same-origin URLs. Sets request's mode.",
    "requestinit-credentials": "A string indicating whether credentials will be sent with the request always, never, or only when sent to a same-origin URL. Sets request's credentials.",
    "requestinit-cache": "A string indicating how the request will interact with the browser's cache to set request's cache.",
    "requestinit-redirect": "A string indicating whether request follows redirects, results in an error upon encountering a redirect, or returns the redirect (in an opaque fashion). Sets request's redirect.",
    "requestinit-integrity": "A cryptographic hash of the resource to be fetched by request. Sets request's integrity.",
    "requestinit-keepalive": "A boolean to set request's keepalive.",
    "requestinit-signal": "An AbortSignal to set request's signal.",
    "requestinit-window": "Can only be null. Used to disassociate request from any Window."
}
