{
    "document-referrer": "Returns the URL of the Document from which the user navigated to this one, unless it was blocked or there was no such document, in which case it returns the empty string.\n\nThe noreferrer link type can be used to block the referrer.",
    "document-cookie": "Returns the HTTP cookies that apply to the Document. If there are no cookies or cookies can't be applied to this resource, the empty string will be returned.\n\nCan be set, to add a new cookie to the element's set of HTTP cookies.\n\nIf the contents are sandboxed into a unique origin (e.g. in an iframe with the sandbox attribute), a \"SecurityError\" DOMException will be thrown on getting and setting.",
    "document-lastmodified": "Returns the date of the last modification to the document, as reported by the server, in the form \"MM/DD/YYYY hh:mm:ss\", in the user's local time zone.\n\nIf the last modification date is not known, the current time is returned instead.",
    "document-readystate": "Returns \"loading\" while the Document is loading, \"interactive\" once it is finished parsing but still loading subresources, and \"complete\" once it has loaded.\n\nThe readystatechange event fires on the Document object when this value changes.\n\nThe DOMContentLoaded event fires after the transition to \"interactive\" but before the transition to \"complete\", at the point where all subresources apart from async script elements have loaded.",
    "document-head": "Returns the head element.",
    "document-body": "Returns the body element.\n\nCan be set, to replace the body element.\n\nIf the new value is not a body or frameset element, this will throw a \"HierarchyRequestError\" DOMException.",
    "document-images": "Returns an HTMLCollection of the img elements in the Document.",
    "document-embeds": "Return an HTMLCollection of the embed elements in the Document.",
    "document-plugins": "Return an HTMLCollection of the embed elements in the Document.",
    "document-links": "Returns an HTMLCollection of the a and area elements in the Document that have href attributes.",
    "document-forms": "Return an HTMLCollection of the form elements in the Document.",
    "document-scripts": "Return an HTMLCollection of the script elements in the Document.",
    "document-getelementsbyname": "Returns a NodeList of elements in the Document that have a name attribute with the value name.",
    "document-currentscript": "Returns the script element, or the SVG script element, that is currently executing, as long as the element represents a classic script. In the case of reentrant script execution, returns the one that most recently started executing amongst those that have not yet finished executing.\n\nReturns null if the Document is not currently executing a script or SVG script element (e.g., because the running script is an event handler, or a timeout), or if the currently executing script or SVG script element represents a module script.",
    "dir": "Returns the html element's dir attribute's value, if any.\n\nCan be set, to either \"ltr\", \"rtl\", or \"auto\" to replace the html element's dir attribute's value.\n\nIf there is no html element, returns the empty string and ignores new values.",
    "style": "Returns a CSSStyleDeclaration object for the element's style attribute.",
    "dataset": "Returns a DOMStringMap object for the element's data-* attributes.\n\nHyphenated names become camel-cased. For example, data-foo-bar=\"\" becomes element.dataset.fooBar.",
    "innertext": "Returns the element's text content \"as rendered\".\n\nCan be set, to replace the element's children with the given value, but with line breaks converted to br elements."
}
