{
    "history": "Returns the number of entries in the joint session history.",
    "document-location": "Returns a Location object with the current page's location.\n\nCan be set, to navigate to another page.",
    "location": "Returns a Location object with the current page's location.\n\nCan be set, to navigate to another page.",
    "location-href": "Returns the Location object's URL.\n\nCan be set, to navigate to the given URL.",
    "location-origin": "Returns the Location object's URL's origin.",
    "location-protocol": "Returns the Location object's URL's scheme.\n\nCan be set, to navigate to the same URL with a changed scheme.",
    "location-host": "Returns the Location object's URL's host and port (if different from the default port for the scheme).\n\nCan be set, to navigate to the same URL with a changed host and port.",
    "location-hostname": "Returns the Location object's URL's host.\n\nCan be set, to navigate to the same URL with a changed host.",
    "location-port": "Returns the Location object's URL's port.\n\nCan be set, to navigate to the same URL with a changed port.",
    "location-pathname": "Returns the Location object's URL's path.\n\nCan be set, to navigate to the same URL with a changed path.",
    "location-search": "Returns the Location object's URL's query (includes leading \"?\" if non-empty).\n\nCan be set, to navigate to the same URL with a changed query (ignores leading \"?\").",
    "location-hash": "Returns the Location object's URL's fragment (includes leading \"#\" if non-empty).\n\nCan be set, to navigate to the same URL with a changed fragment (ignores leading \"#\").",
    "location-assign": "Navigates to the given URL.",
    "location-replace": "Removes the current page from the session history and navigates to the given URL.",
    "location-reload": "Reloads the current page.",
    "location-ancestororigins": "Returns a DOMStringList object listing the origins of the ancestor browsing contexts, from the parent browsing context to the top-level browsing context."
}
