{
    "table-caption": "Returns the table's caption element.\n\nCan be set, to replace the caption element.",
    "table-createcaption": "Ensures the table has a caption element, and returns it.",
    "table-deletecaption": "Ensures the table does not have a caption element.",
    "table-thead": "Returns the table's thead element.\n\nCan be set, to replace the thead element. If the new value is not a thead element, throws a \"HierarchyRequestError\" DOMException.",
    "table-createthead": "Ensures the table has a thead element, and returns it.",
    "table-deletethead": "Ensures the table does not have a thead element.",
    "table-tfoot": "Returns the table's tfoot element.\n\nCan be set, to replace the tfoot element. If the new value is not a tfoot element, throws a \"HierarchyRequestError\" DOMException.",
    "table-createtfoot": "Ensures the table has a tfoot element, and returns it.",
    "table-deletetfoot": "Ensures the table does not have a tfoot element.",
    "table-tbodies": "Returns an HTMLCollection of the tbody elements of the table.",
    "table-createtbody": "Creates a tbody element, inserts it into the table, and returns it.",
    "table-rows": "Returns an HTMLCollection of the tr elements of the table.",
    "table-insertrow": "Creates a tr element, along with a tbody if required, inserts them into the table at the position given by the argument, and returns the tr.\n\nThe position is relative to the rows in the table. The index −1, which is the default if the argument is omitted, is equivalent to inserting at the end of the table.\n\nIf the given position is less than −1 or greater than the number of rows, throws an \"IndexSizeError\" DOMException.",
    "table-deleterow": "Removes the tr element with the given position in the table.\n\nThe position is relative to the rows in the table. The index −1 is equivalent to deleting the last row of the table.\n\nIf the given position is less than −1 or greater than the index of the last row, or if there are no rows, throws an \"IndexSizeError\" DOMException.",
    "tbody-rows": "Returns an HTMLCollection of the tr elements of the table section.",
    "tbody-insertrow": "Creates a tr element, inserts it into the table section at the position given by the argument, and returns the tr.\n\nThe position is relative to the rows in the table section. The index −1, which is the default if the argument is omitted, is equivalent to inserting at the end of the table section.\n\nIf the given position is less than −1 or greater than the number of rows, throws an \"IndexSizeError\" DOMException.",
    "tbody-deleterow": "Removes the tr element with the given position in the table section.\n\nThe position is relative to the rows in the table section. The index −1 is equivalent to deleting the last row of the table section.\n\nIf the given position is less than −1 or greater than the index of the last row, or if there are no rows, throws an \"IndexSizeError\" DOMException.",
    "tr-rowindex": "Returns the position of the row in the table's rows list.\n\nReturns −1 if the element isn't in a table.",
    "tr-sectionrowindex": "Returns the position of the row in the table section's rows list.\n\nReturns −1 if the element isn't in a table section.",
    "tr-cells": "Returns an HTMLCollection of the td and th elements of the row.",
    "tr-insertcell": "Creates a td element, inserts it into the table row at the position given by the argument, and returns the td.\n\nThe position is relative to the cells in the row. The index −1, which is the default if the argument is omitted, is equivalent to inserting at the end of the row.\n\nIf the given position is less than −1 or greater than the number of cells, throws an \"IndexSizeError\" DOMException.",
    "tr-deletecell": "Removes the td or th element with the given position in the row.\n\nThe position is relative to the cells in the row. The index −1 is equivalent to deleting the last cell of the row.\n\nIf the given position is less than −1 or greater than the index of the last cell, or if there are no cells, throws an \"IndexSizeError\" DOMException.",
    "tdth-cellindex": "Returns the position of the cell in the row's cells list. This does not necessarily correspond to the x-position of the cell in the table, since earlier cells might cover multiple rows or columns.\n\nReturns −1 if the element isn't in a row."
}
