{
    "video-videowidth": "These attributes return the intrinsic dimensions of the video, or zero if the dimensions are not known.",
    "video-videoheight": "These attributes return the intrinsic dimensions of the video, or zero if the dimensions are not known.",
    "audio": "Returns a new audio element, with the src attribute set to the value passed in the argument, if applicable.",
    "track-readystate": "Returns the text track readiness state, represented by a number from the following list:",
    "track-track": "Returns the TextTrack object corresponding to the text track of the track element.",
    "media-error": "Returns a MediaError object representing the current error state of the element.\n\nReturns null if there is no error.",
    "media-srcobject": "Allows the media element to be assigned a media provider object.",
    "media-currentsrc": "Returns the URL of the current media resource, if any.\n\nReturns the empty string when there is no media resource, or it doesn't have a URL.",
    "navigator-canplaytype": "Returns the empty string (a negative response), \"maybe\", or \"probably\" based on how confident the user agent is that it can play media resources of the given type.",
    "media-networkstate": "Returns the current state of network activity for the element, from the codes in the list below.",
    "media-load": "Causes the element to reset and start selecting and loading a new media resource from scratch.",
    "media-buffered": "Returns a TimeRanges object that represents the ranges of the media resource that the user agent has buffered.",
    "media-duration": "Returns the length of the media resource, in seconds, assuming that the start of the media resource is at time zero.\n\nReturns NaN if the duration isn't available.\n\nReturns Infinity for unbounded streams.",
    "media-currenttime": "Returns the official playback position, in seconds.\n\nCan be set, to seek to the given time.",
    "media-readystate": "Returns a value that expresses the current state of the element with respect to rendering the current playback position, from the codes in the list below.",
    "media-paused": "Returns true if playback is paused; false otherwise.",
    "media-ended": "Returns true if playback has reached the end of the media resource.",
    "media-defaultplaybackrate": "Returns the default rate of playback, for when the user is not fast-forwarding or reversing through the media resource.\n\nCan be set, to change the default rate of playback.\n\nThe default rate has no direct effect on playback, but if the user switches to a fast-forward mode, when they return to the normal playback mode, it is expected that the rate of playback will be returned to the default rate of playback.",
    "media-playbackrate": "Returns the current rate playback, where 1.0 is normal speed.\n\nCan be set, to change the rate of playback.",
    "media-played": "Returns a TimeRanges object that represents the ranges of the media resource that the user agent has played.",
    "media-play": "Sets the paused attribute to false, loading the media resource and beginning playback if necessary. If the playback had ended, will restart it from the start.",
    "media-pause": "Sets the paused attribute to true, loading the media resource if necessary.",
    "media-seeking": "Returns true if the user agent is currently seeking.",
    "media-seekable": "Returns a TimeRanges object that represents the ranges of the media resource to which it is possible for the user agent to seek.",
    "media-fastseek": "Seeks to near the given time as fast as possible, trading precision for speed. (To seek to a precise time, use the currentTime attribute.)\n\nThis does nothing if the media resource has not been loaded.",
    "media-audiotracks": "Returns an AudioTrackList object representing the audio tracks available in the media resource.",
    "media-videotracks": "Returns a VideoTrackList object representing the video tracks available in the media resource.",
    "audiotrack-id": "Returns the ID of the given track. This is the ID that can be used with a fragment if the format supports media fragment syntax, and that can be used with the getTrackById() method.",
    "videotrack-id": "Returns the ID of the given track. This is the ID that can be used with a fragment if the format supports media fragment syntax, and that can be used with the getTrackById() method.",
    "audiotrack-kind": "Returns the category the given track falls into. The possible track categories are given below.",
    "videotrack-kind": "Returns the category the given track falls into. The possible track categories are given below.",
    "audiotrack-label": "Returns the label of the given track, if known, or the empty string otherwise.",
    "videotrack-label": "Returns the label of the given track, if known, or the empty string otherwise.",
    "audiotrack-language": "Returns the language of the given track, if known, or the empty string otherwise.",
    "videotrack-language": "Returns the language of the given track, if known, or the empty string otherwise.",
    "audiotrack-enabled": "Returns true if the given track is active, and false otherwise.\n\nCan be set, to change whether the track is enabled or not. If multiple audio tracks are enabled simultaneously, they are mixed.",
    "videotrack-selected": "Returns true if the given track is active, and false otherwise.\n\nCan be set, to change whether the track is selected or not. Either zero or one video track is selected; selecting a new track while a previous one is selected will unselect the previous one.",
    "media-texttracks": "Returns the number of text tracks associated with the media element (e.g. from track elements). This is the number of text tracks in the media element's list of text tracks.",
    "media-addtexttrack": "Creates and returns a new TextTrack object, which is also added to the media element's list of text tracks.",
    "texttrack-kind": "Returns the text track kind string.",
    "texttrack-label": "Returns the text track label, if there is one, or the empty string otherwise (indicating that a custom label probably needs to be generated from the other attributes of the object if the object is exposed to the user).",
    "texttrack-language": "Returns the text track language string.",
    "texttrack-id": "Returns the ID of the given track.\n\nFor in-band tracks, this is the ID that can be used with a fragment if the format supports media fragment syntax, and that can be used with the getTrackById() method.\n\nFor TextTrack objects corresponding to track elements, this is the ID of the track element.",
    "texttrack-inbandmetadatatrackdispatchtype": "Returns the text track in-band metadata track dispatch type string.",
    "texttrack-mode": "Returns the text track mode, represented by a string from the following list:\n\nCan be set, to change the mode.",
    "texttrack-cues": "Returns the text track list of cues, as a TextTrackCueList object.",
    "texttrack-activecues": "Returns the text track cues from the text track list of cues that are currently active (i.e. that start before the current playback position and end after it), as a TextTrackCueList object.",
    "texttrack-addcue": "Adds the given cue to textTrack's text track list of cues.",
    "texttrack-removecue": "Removes the given cue from textTrack's text track list of cues.",
    "texttrackcuelist-length": "Returns the number of cues in the list.",
    "texttrackcuelist-getcuebyid": "Returns the first text track cue (in text track cue order) with text track cue identifier id.\n\nReturns null if none of the cues have the given identifier or if the argument is the empty string.",
    "texttrackcue-track": "Returns the TextTrack object to which this text track cue belongs, if any, or null otherwise.",
    "texttrackcue-id": "Returns the text track cue identifier.\n\nCan be set.",
    "texttrackcue-starttime": "Returns the text track cue start time, in seconds.\n\nCan be set.",
    "texttrackcue-endtime": "Returns the text track cue end time, in seconds.\n\nCan be set.",
    "texttrackcue-pauseonexit": "Returns true if the text track cue pause-on-exit flag is set, false otherwise.\n\nCan be set.",
    "media-volume": "Returns the current playback volume, as a number in the range 0.0 to 1.0, where 0.0 is the quietest and 1.0 the loudest.\n\nCan be set, to change the volume.\n\nThrows an \"IndexSizeError\" DOMException if the new value is not in the range 0.0 .. 1.0.",
    "media-muted": "Returns true if audio is muted, overriding the volume attribute, and false if the volume attribute is being honored.\n\nCan be set, to change whether the audio is muted or not.",
    "timeranges-length": "Returns the number of ranges in the object.",
    "timeranges-start": "Returns the time for the start of the range with the given index.\n\nThrows an \"IndexSizeError\" DOMException if the index is out of range.",
    "timeranges-end": "Returns the time for the end of the range with the given index.\n\nThrows an \"IndexSizeError\" DOMException if the index is out of range.",
    "trackevent-track": "Returns the track object (TextTrack, AudioTrack, or VideoTrack) to which the event relates.",
    "track-none": "The text track not loaded state.",
    "track-loading": "The text track loading state.",
    "track-loaded": "The text track loaded state.",
    "track-error": "The text track failed to load state.",
    "texttrack-disabled": "The text track disabled mode.",
    "texttrack-hidden": "The text track hidden mode.",
    "texttrack-showing": "The text track showing mode."
}
