{
    "xmlhttprequest": "Returns a new XMLHttpRequest object.",
    "xmlhttprequest-readystate": "Returns client's state.",
    "xmlhttprequest-open": "Sets the request method, request URL, and synchronous flag.\nThrows a \"SyntaxError\" DOMException if either method is not a\nvalid HTTP method or url cannot be parsed.\nThrows a \"SecurityError\" DOMException if method is a\ncase-insensitive match for `CONNECT`, `TRACE`, or `TRACK`.\nThrows an \"InvalidAccessError\" DOMException if async is false, current global object is a Window object, and the timeout attribute is not zero or the responseType attribute is not the empty string.",
    "xmlhttprequest-setrequestheader": "Combines a header in author request headers.\nThrows an \"InvalidStateError\" DOMException if either state is not opened or the send() flag is set.\nThrows a \"SyntaxError\" DOMException if name is not a header name\nor if value is not a header value.",
    "xmlhttprequest-timeout": "Can be set to a time in milliseconds. When set to a non-zero value will cause fetching to terminate after the given time has passed. When the time has passed, the\nrequest has not yet completed, and the synchronous flag is unset, a timeout event will then be dispatched, or a\n\"TimeoutError\" DOMException will be thrown otherwise (for the send() method).\nWhen set: throws an \"InvalidAccessError\" DOMException if the synchronous flag is set and current global object is a Window object.",
    "xmlhttprequest-withcredentials": "True when credentials are to be included in a cross-origin request. False when they are\nto be excluded in a cross-origin request and when cookies are to be ignored in its response.\nInitially false.\nWhen set: throws an \"InvalidStateError\" DOMException if state is not unsent or opened, or if the send() flag is set.",
    "xmlhttprequest-upload": "Returns the associated XMLHttpRequestUpload object. It can be used to gather transmission information when data is\ntransferred to a server.",
    "xmlhttprequest-send": "Initiates the request. The body argument provides the request body, if any,\nand is ignored if the request method is GET or HEAD.\nThrows an \"InvalidStateError\" DOMException if either state is not opened or the send() flag is set.",
    "xmlhttprequest-abort": "Cancels any network activity.",
    "xmlhttprequest-overridemimetype": "Acts as if the `Content-Type` header value for response is mime.\n(It does not actually change the header though.)\nThrows an \"InvalidStateError\" DOMException if state is loading or done.",
    "xmlhttprequest-responsetype": "Returns the response type.\nCan be set to change the response type. Values are:\nthe empty string (default),\n\"arraybuffer\",\n\"blob\",\n\"document\",\n\"json\", and\n\"text\".\nWhen set: setting to \"document\" is ignored if current global object is not a Window object.\nWhen set: throws an \"InvalidStateError\" DOMException if state is loading or done.\nWhen set: throws an \"InvalidAccessError\" DOMException if the synchronous flag is set and current global object is a Window object.",
    "xmlhttprequest-response": "Returns the response's body.",
    "xmlhttprequest-responsetext": "Returns the text response.\nThrows an \"InvalidStateError\" DOMException if responseType is not the empty string or \"text\".",
    "xmlhttprequest-responsexml": "Returns the document response.\nThrows an \"InvalidStateError\" DOMException if responseType is not the empty string or \"document\"."
}
